; domain
(define (domain transport-strips)
(:requirements :typing :action-costs)

(:types location fuellevel locatable - object 
	package truck - locatable
)

(:predicates 
(connected ?l1 ?l2 - location)
(at ?o - locatable ?l - location)
(in ?p - package ?t - truck)
(fuel ?t - truck ?level - fuellevel)
(fuelcost ?level - fuellevel ?l1 ?l2 - location)
(sum ?a ?b ?c - fuellevel)
)

(:functions 
(total-cost) - number)

(:action LOAD
:parameters
(?p - package
?t - truck
?l - location)
:precondition
(and (at ?t ?l) (at ?p ?l))
:effect
(and (not (at ?p ?l)) (in ?p ?t) (increase (total-cost) 1))
)

(:action UNLOAD
:parameters
(?p - package
?t - truck
?l - location)
:precondition
(and (at ?t ?l) (in ?p ?t))
:effect
(and (at ?p ?l) (not (in ?p ?t)) (increase (total-cost) 1))
)

(:action DRIVE
:parameters
(?t - truck
?l1 - location
?l2 - location
?fuelpost - fuellevel
?fueldelta - fuellevel
?fuelpre - fuellevel)
:precondition
(and 
(connected ?l1 ?l2)
(fuelcost ?fueldelta ?l1 ?l2)
(fuel ?t ?fuelpre)
(sum ?fuelpost ?fueldelta ?fuelpre)
(at ?t ?l1)
)
:effect
(and (not (at ?t ?l1)) 
     (at ?t ?l2) 
     (not (fuel ?t ?fuelpre)) 
     (fuel ?t ?fuelpost)
     (increase (total-cost) 1))
)

)

; problem
(define (problem transport-l3-t1-p2---int100n150-m25---int100c150---s2---e0)
(:domain transport-strips)

(:objects
l0 l1 l2 - location
t0 - truck
p0 p1 - package
level0 level1 level2 level3 level4 level5 level6 level7 level8 level9 level10 level11 level12 level13 level14 level15 level16 level17 level18 level19 level20 level21 level22 level23 level24 level25 level26 level27 level28 level29 level30 level31 level32 level33 level34 level35 level36 level37 level38 level39 level40 level41 level42 level43 - fuellevel
)

(:init
(sum level0 level3 level3)
(sum level0 level13 level13)
(sum level0 level24 level24)
(sum level1 level3 level4)
(sum level1 level13 level14)
(sum level1 level24 level25)
(sum level2 level3 level5)
(sum level2 level13 level15)
(sum level2 level24 level26)
(sum level3 level3 level6)
(sum level3 level13 level16)
(sum level3 level24 level27)
(sum level4 level3 level7)
(sum level4 level13 level17)
(sum level4 level24 level28)
(sum level5 level3 level8)
(sum level5 level13 level18)
(sum level5 level24 level29)
(sum level6 level3 level9)
(sum level6 level13 level19)
(sum level6 level24 level30)
(sum level7 level3 level10)
(sum level7 level13 level20)
(sum level7 level24 level31)
(sum level8 level3 level11)
(sum level8 level13 level21)
(sum level8 level24 level32)
(sum level9 level3 level12)
(sum level9 level13 level22)
(sum level9 level24 level33)
(sum level10 level3 level13)
(sum level10 level13 level23)
(sum level10 level24 level34)
(sum level11 level3 level14)
(sum level11 level13 level24)
(sum level11 level24 level35)
(sum level12 level3 level15)
(sum level12 level13 level25)
(sum level12 level24 level36)
(sum level13 level3 level16)
(sum level13 level13 level26)
(sum level13 level24 level37)
(sum level14 level3 level17)
(sum level14 level13 level27)
(sum level14 level24 level38)
(sum level15 level3 level18)
(sum level15 level13 level28)
(sum level15 level24 level39)
(sum level16 level3 level19)
(sum level16 level13 level29)
(sum level16 level24 level40)
(sum level17 level3 level20)
(sum level17 level13 level30)
(sum level17 level24 level41)
(sum level18 level3 level21)
(sum level18 level13 level31)
(sum level18 level24 level42)
(sum level19 level3 level22)
(sum level19 level13 level32)
(sum level19 level24 level43)
(sum level20 level3 level23)
(sum level20 level13 level33)
(sum level21 level3 level24)
(sum level21 level13 level34)
(sum level22 level3 level25)
(sum level22 level13 level35)
(sum level23 level3 level26)
(sum level23 level13 level36)
(sum level24 level3 level27)
(sum level24 level13 level37)
(sum level25 level3 level28)
(sum level25 level13 level38)
(sum level26 level3 level29)
(sum level26 level13 level39)
(sum level27 level3 level30)
(sum level27 level13 level40)
(sum level28 level3 level31)
(sum level28 level13 level41)
(sum level29 level3 level32)
(sum level29 level13 level42)
(sum level30 level3 level33)
(sum level30 level13 level43)
(sum level31 level3 level34)
(sum level32 level3 level35)
(sum level33 level3 level36)
(sum level34 level3 level37)
(sum level35 level3 level38)
(sum level36 level3 level39)
(sum level37 level3 level40)
(sum level38 level3 level41)
(sum level39 level3 level42)
(sum level40 level3 level43)

(connected l0 l1)
(fuelcost level3 l0 l1)
(connected l0 l2)
(fuelcost level24 l0 l2)
(connected l1 l0)
(fuelcost level3 l1 l0)
(connected l1 l2)
(fuelcost level13 l1 l2)
(connected l2 l0)
(fuelcost level24 l2 l0)
(connected l2 l1)
(fuelcost level13 l2 l1)

(at t0 l0)
(fuel t0 level43)
(= (total-cost) 0)

(at p0 l2)
(at p1 l1)
)

(:goal
(and
(at p0 l1)
(at p1 l2)
)
)
(:metric minimize (total-cost)))

; plan
1. (drive t0 l0 l1 level40 level3 level43)
   deleted: (at t0 l0) (fuel t0 level43)
   added: (at t0 l1) (fuel t0 level40)
   goals met: 0 of 2
2. (load p1 t0 l1)
   deleted: (at p1 l1)
   added: (in p1 t0)
   goals met: 0 of 2
3. (drive t0 l1 l2 level27 level13 level40)
   deleted: (at t0 l1) (fuel t0 level40)
   added: (at t0 l2) (fuel t0 level27)
   goals met: 0 of 2
4. (load p0 t0 l2)
   deleted: (at p0 l2)
   added: (in p0 t0)
   goals met: 0 of 2
5. (unload p1 t0 l2)
   deleted: (in p1 t0)
   added: (at p1 l2)
   goals met: 1 of 2
6. (drive t0 l2 l1 level14 level13 level27)
   deleted: (at t0 l2) (fuel t0 level27)
   added: (at t0 l1) (fuel t0 level14)
   goals met: 1 of 2
7. (unload p0 t0 l1)
   deleted: (in p0 t0)
   added: (at p0 l1)
   goals met: 2 of 2
